{
  "Article_Data": [
    {
      "article": "Federal Reserve Vice Chairman Richard Clarida said he expects the economy to continue to recover through the year and likely return to its pre-pandemic level by the end of the 2021. In an interview with Steve Liesman on CNBC's \"Squawk Box,\" the central bank's director of bank supervision said he hasn't changed his forecast despite a swell in Covid-19 cases that has caused a general slowing in resumption of activities. \"The economy took a huge hit in the spring,\" Clarida said. \"My own personal forecast is that we'll see a rebound in economic activity in the third-quarter data. The course of the economy is going to depend on the course of the virus, and it's a complex picture.\" Clarida spoke just minutes after ADP reported a sharp slowdown in private payroll growth for July. Companies added just 167,000 positions for the month after a surge of 4.3 million in June. Though the number was well below the Wall Street estimate of 1 million, Clarida said he would reserve judgment on the jobs market until seeing Friday's nonfarm payrolls report from the Labor Department. Economists surveyed by Dow Jones are expecting growth of nearly 1.5 million after the record 4.8 million in June. \"It will take some time I believe before we get back to the level of activity we were at in February before the pandemic hit,\" he said. \"My baseline view is that we could get back to the level of activity perhaps towards the end of 2021. There are a lot of moving parts with the virus and the global outlook.\" One factor causing Clarida to hold to his forecast is the expectation for more rescue funding from Congress. Though an impasse between congressional Democrats and the White House allowed extended unemployment compensation benefits to expire, talks are ongoing and leaders in Washington have expressed a likelihood that some compromise will be reached. \"The longer this drags on, the greater risk there is to long-term damage to the economy,\" Clarida said. \"I don't think we're at that point yet.\"",
      "author": [
        "Jeff Cox"
      ],
      "category": "The Fed",
      "description": "The central bank's director of bank supervision said he hasn't changed his forecast despite a swell in Covid-19 cases that have caused a general slowing in resumption of activities",
      "download_date": "2020-08-05 19:22:56",
      "filename": "https://www.cnbc.com/2020/08/05/fed-vice-chair-clarida-still-sees-the-economy-staging-a-comeback-this-year.html.json",
      "headline": "Fed Vice Chair Clarida still sees the economy staging a comeback this year",
      "image_url": "https://image.cnbcfm.com/api/v1/image/105135225-IMG_7602g.jpg?v=1542224773",
      "keyword": [
        "sees",
        "reserve",
        "growth",
        "million",
        "level",
        "forecast",
        "hit",
        "vice",
        "fed",
        "comeback",
        "clarida",
        "chair",
        "virus",
        "activity",
        "staging",
        "economy"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:26:48",
      "source_domain": "www.cnbc.com",
      "summary": "Federal Reserve Vice Chairman Richard Clarida said he expects the economy to continue to recover through the year and likely return to its pre-pandemic level by the end of the 2021. \"The economy took a huge hit in the spring,\" Clarida said. The course of the economy is going to depend on the course of the virus, and it's a complex picture.\" \"My baseline view is that we could get back to the level of activity perhaps towards the end of 2021. \"The longer this drags on, the greater risk there is to long-term damage to the economy,\" Clarida said.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/fed-vice-chair-clarida-still-sees-the-economy-staging-a-comeback-this-year.html"
    },
    {
      "article": "SpaceX's prototype Starship launches in a short first flight test at the company's facility in Boca Chica, Texas. SpaceX The fifth prototype of SpaceX's next-generation Starship rocket passed its most critical test yet, taking off and landing in a short flight on Tuesday at the company's facility in Texas. Starship prototype Serial Number 5, standing at about 100 feet tall, launched gradually and rose to about 500 feet above the ground before returning back to land on a concrete area near the launchpad. \"Progress is accelerating,\" SpaceX CEO Elon Musk tweeted after the flight. SpaceX's prototype Starship launches in a short first flight test at the company's facility in Boca Chica, Texas. SpaceX SpaceX has a fleet of rockets that it uses to launch satellites and astronauts, anchored by its Falcon 9 series that has launched 87 times -- and landed its booster after 48 of those launches. But Starship represents the company's aim to make obsolete even the cost-saving advances of its Falcon 9 rockets. While Falcon 9 rockets are partially reusable, Musk's goal is to make Starship fully reusable -- envisioning a rocket that is more akin to a commercial airplane, with short turnaround times between flights where the only major cost is fuel. Musk last year unveiled the Starship prototype, built of stainless steel and dwarfing the company's existing spacecraft. SpaceX is developing Starship with the goal of launching as many as 100 people at a time on missions to the moon and Mars. SpaceX's Starship prototype SN5 on the company's landing pad after completing its flight test. SpaceX After SpaceX in May launched a pair of NASA astronauts in its first crewed mission, Musk pivoted the company's attention, declaring that the top SpaceX priority is now development of Starship. Musk said in an email obtained by CNBC that Starship's program must accelerate \"dramatically and immediately,\" SpaceX released video of the flight test captured by an aerial drone, as well as a camera underneath the rocket that showed the Raptor engine and the legs deploy for landing. President Donald Trump also shared video of SpaceX's SN5 flight, although he appeared to confuse the company with NASA in a tweet. Although it wasn't a NASA test, leaders of the agency were notably paying attention to the SpaceX flight. NASA associate administrator Dr. Thomas Zurbuchen offered his congratulations to Musk's company on the successful flight. Starship is one of SpaceX's ambitious programs, for which the company has raised about $3.5 billion in private capital to fund. But after a successful test flight a year ago completed by a previous iteration, known as Starhopper, the Starship program suffered several explosive setbacks in development. Those setbacks are part of Musk's motivation for asking more of SpaceX's about 8,000 employees to spend more time in Texas, even offering use of the company's private jet if people are willing to move from the company's facilities in California and Florida. The extraordinary relocation offer underlines how crucial Musk sees the Starship project. SpaceX is already bidding for NASA contracts with Starship, most recently winning $135 million to compete against Jeff Bezos' Blue Origin to deliver astronauts to the Moon. The company's Boca Chica team is already working nearly around the clock but Musk wants more, urging SpaceX employees to help Starship development progress even more quickly. A look at the Raptor engine underneath SpaceX's prototype Starship rocket and the small legs that deployed for landing. SpaceX",
      "author": [
        "Michael Sheetz"
      ],
      "category": "Investing in Space",
      "description": "The fifth prototype of SpaceX's next-generation Starship rocket passed its most critical test yet.",
      "download_date": "2020-08-05 19:23:44",
      "filename": "https://www.cnbc.com/2020/08/05/spacex-launches-lands-starship-prototype-rocket-in-short-flight-test.html.json",
      "headline": "SpaceX launches and lands prototype of its Mars rocket Starship in key short flight test",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106649024-1596628440990-spacex_sn5_2.PNG?v=1596628545",
      "keyword": [
        "spacexs",
        "launches",
        "musk",
        "texas",
        "lands",
        "rocket",
        "key",
        "flight",
        "test",
        "spacex",
        "starship",
        "nasa",
        "short",
        "mars",
        "prototype",
        "companys"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:40:04",
      "source_domain": "www.cnbc.com",
      "summary": "SpaceX's prototype Starship launches in a short first flight test at the company's facility in Boca Chica, Texas. SpaceX's prototype Starship launches in a short first flight test at the company's facility in Boca Chica, Texas. SpaceX's Starship prototype SN5 on the company's landing pad after completing its flight test. Although it wasn't a NASA test, leaders of the agency were notably paying attention to the SpaceX flight. A look at the Raptor engine underneath SpaceX's prototype Starship rocket and the small legs that deployed for landing.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/spacex-launches-lands-starship-prototype-rocket-in-short-flight-test.html"
    },
    {
      "article": "Sen. Marco Rubio, R-Fla., warned on Wednesday that a new wave of small business layoffs could come if Congress does not re-up the funding to the Paycheck Protection Program in its next round of coronavirus relief spending. \"You are going to begin to see, at some point, small business layoffs again as companies run out of the PPP money,\" Rubio said on CNBC's \"Squawk Box.\" \"That's a real thing, and we are going to see it unfortunately, and then that begins to trickle across the rest of the economy including the real estate sector because they can't pay rent, and so forth,\" Rubio said. \"And so we have to act, we have to do something.' The Florida Republican's comments came as Democrats and the White House continued negotiations over the next Covid-19 stimulus package. The two sides have said that progress has been slow, and a deal is not expected until next week at the earliest. Rubio is the chairman of the Senate Small Business Committee. The PPP allows small businesses to receive low-interest loans that are completely forgiven if certain guidelines are followed, such as using the money primarily on covering payroll. About $130 billion of the $650 billion allocated toward the program remains untapped. An administration official told CNBC on Monday night that Democrats and Republicans have come to an agreement on extending PPP funding, though the exact details remain unclear. Republicans proposed last week allocating $190 billion to the program. In contrast, a $3 trillion proposal unveiled by House Democrats in May did not include any new PPP funding. Sen. Ben Cardin, D-Md., the top Democrat on the Senate's Small Business Committee, said on Tuesday that he was largely on board with the Republican proposal. There is evidence that the PPP helped keep the economy from completely collapsing after Covid-19 forced closures of many businesses around the country. One preliminary study, by researchers at the Massachusetts Institute of Technology and the Federal Reserve, estimates the program saved between 1.4 million to 3.2 million jobs. Small businesses have warned that they may have to start firing workers if they are unable to secure more federal funds. According to a survey by the National Federation of Independent Business, approximately one fifth of small business owners expect they may have to terminate workers after using their PPP loan. Nearly half suspect they will need more financial support in the next year. On Monday, more than 100 former or current top executives, including Facebook Chief Operations Officer Sheryl Sandberg and Microsoft CEO Satya Nadella, issued a letter to Congress to do more than just \"another round of PPP.\" The executives called for Congress to pass legislation creating federally guaranteed loans \"that will enable small businesses to transform and sustain themselves through 2020 and well into 2021.\" They also argued in favor of legislation proposed by Sens. Michael Bennet, D-Colo., and Todd Young, R-Ind., that would provide partially forgivable loans to cover six months of expenses for businesses that have been especially hard hit. Rubio said that he was not opposed to the idea of Bennet and Young's bill, known as the RESTART act, but that it was too costly and could be cumbersome for the Small Business Administration to administer. \"We have tried to incorporate a version of that bill scaled down,\" Rubio said.",
      "author": [
        "Tucker Higgins",
        "In"
      ],
      "category": "Politics",
      "description": "Marco Rubio warned that a new wave of small business layoffs could come if Congress does not re-up the funding to the Paycheck Protection Program in its next round of coronavirus relief spending.",
      "download_date": "2020-08-05 19:24:24",
      "filename": "https://www.cnbc.com/2020/08/05/rubio-warns-of-surge-in-small-business-layoffs-if-ppp-money-dries-up.html.json",
      "headline": "Rubio warns of surge in small business layoffs if PPP money dries up",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106640773-15961278112020-07-30t145351z_1269933604_rc2q3i9lt5vj_rtrmadp_0_usa-senate-pompeo.jpeg?v=1596127887",
      "keyword": [
        "warns",
        "small",
        "rubio",
        "ppp",
        "loans",
        "congress",
        "businesses",
        "business",
        "democrats",
        "surge",
        "money",
        "layoffs",
        "billion",
        "program",
        "dries"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:38:32",
      "source_domain": "www.cnbc.com",
      "summary": "\"You are going to begin to see, at some point, small business layoffs again as companies run out of the PPP money,\" Rubio said on CNBC's \"Squawk Box.\" Rubio is the chairman of the Senate Small Business Committee. Sen. Ben Cardin, D-Md., the top Democrat on the Senate's Small Business Committee, said on Tuesday that he was largely on board with the Republican proposal. Small businesses have warned that they may have to start firing workers if they are unable to secure more federal funds. According to a survey by the National Federation of Independent Business, approximately one fifth of small business owners expect they may have to terminate workers after using their PPP loan.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/rubio-warns-of-surge-in-small-business-layoffs-if-ppp-money-dries-up.html"
    },
    {
      "article": "(This story is for CNBC PRO subscribers only.) Investors are selling shares of Nikola following the company's first quarterly report as a public company, but major Wall Street firms think the stock is still a buy, and that the sell-off offers an attractive entry point. The stock fell more than 15% during early trading on Wednesday. \"There are catalysts immediately ahead, and we therefore recommend accumulating shares in NKLA,\" said JPMorgan, while Deutsche Bank said the the stock continues to offer a \"favorable near term set up.\"",
      "author": [
        "Pippa Stevens"
      ],
      "category": "Pro: Street Calls",
      "description": "The Street reacts to Nikola's first quarterly report as a public company.",
      "download_date": "2020-08-05 19:25:16",
      "filename": "https://www.cnbc.com/2020/08/05/major-banks-say-to-buy-nikola-on-the-dip-citing-confusion-over-the-quarterly-results.html.json",
      "headline": "Major banks say to buy Nikola on the dip, citing confusion over the quarterly results",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106587110-1592834759853nikola_badger3.jpg?v=1592835074",
      "keyword": [
        "wall",
        "street",
        "banks",
        "subscribers",
        "say",
        "term",
        "dip",
        "nikola",
        "citing",
        "confusion",
        "major",
        "results",
        "set",
        "stock",
        "quarterly",
        "shares",
        "wednesdaythere",
        "buy",
        "trading",
        "think"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:30:19",
      "source_domain": "www.cnbc.com",
      "summary": "(This story is for CNBC PRO subscribers only.) Investors are selling shares of Nikola following the company's first quarterly report as a public company, but major Wall Street firms think the stock is still a buy, and that the sell-off offers an attractive entry point. The stock fell more than 15% during early trading on Wednesday. \"There are catalysts immediately ahead, and we therefore recommend accumulating shares in NKLA,\" said JPMorgan, while Deutsche Bank said the the stock continues to offer a \"favorable near term set up.\"",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/major-banks-say-to-buy-nikola-on-the-dip-citing-confusion-over-the-quarterly-results.html"
    },
    {
      "article": "With Covid-19 cases surging in so many states and outbreaks of popping up at camps from Georgia to Oregon, the safest place for you and your kids to be this summer could be in your own backyard. Here six affordable ways to turn your home into a vacation spot to make the most of this homebound season. Do camp activities at home While nothing beats the real-deal, Lori Lerman Rotman, the director at Maine's Camp Caribou, says that with a little creativity, there's plenty of camp-like fun to be had at home. \"We remain strong together through simple traditions like summertime foods, toasts and a campfire, fire pit, or even a candle!\" says Rotman. The camping vet says that eating s'mores together, sing alongs, art activities like tie-dying shirts, inventing secret handshakes and even camping out on your lawn can bring the feeling of camp home. Transform your bathroom into a spa with a virtual facial Skincare expert Lydia Sarfati -- whose skincare product line is used at resorts around the globe -- says you can give yourself a spa-worthy treatment at home. Put some fresh flowers, candles and clean towels in your bathroom, turn on soothing music and make yourself a cup iced water with lemon or cucumber. Then take a bath and put on a face mask, she says. \"In 20 minutes you'll feel like you were in a spa,\" says Sarfati. Once you dry off, massage your favorite body cream onto your skin and work out any kinks in your neck with a Kansa wand, which is an ancient Ayurvedic massage tool. And if your facial skin needs some extra love with all that sweaty mask-wearing, you can book a virtual consultation with Sarfati. She will inspect your skin on Zoom or FaceTime and make product reccommendations from her skincare line Repechage. Produce outdoor plays or an at-home art gallery Many performing arts destinations will stay closed until next year, so Boston Children's Museum educator Melissa Higgins suggests producing a play or curating an at-home art gallery with the kids. To put on a play, use your front steps or backyard deck as a stage, add accent furniture from around the house as props and old clothes can be reworked into costumes, says Higgins. You can act out an original play by the kids or find one online. For the art gallery, have the kids draw their own creations or print out photos the kids are drawn to online. Then hang the photos on your hallway walls to curate a show together. \"These activities are fun ways for kids to practice perspective-taking, explore their passions and let their imaginations go,\" Higgins says. Go around the world in 30 movies David Bueno, general manager at The Jefferson hotel in Washington, D.C. says its pretty simple to create themed movie nights in your backyard. All you need is a white sheet, an inexpensive projector and takeout. \"You could order foods from restaurants based on country themes,\" says Bueno. Watch \"Slumdog Millionaire\" with your favorite Indian food or \"Sweet Home Alabama\" with southern fare like fried chicken. \"Alternatively, you could binge watch episodes of Chef's Table on Netflix, taking you to amazing places around the world, and eat the cuisine from the region they are in,\" he says. Have a Vegas-style pool party You don't need an in-ground pool to have a pool party this summer. For a few hundred dollars you can buy an adult-sized temporary pool, or if you want to be really hipster, get in on the Instagram-friendly trend of stock tank pools. (Stock tanks are actually troughs for livestock but people are turning them into backyard oasis.) Drain your pool daily or add safe chlorine balls (like you would a hot tub) for longer water use. Throw in an LED-lit swan float and hire a virtual DJ and it will be just like Vegas, but without the regret. Make Disney park food at home",
      "author": [
        "Erica Corsano",
        "Special To Cnbc Make It"
      ],
      "category": "Make It - Life",
      "description": "With Covid-19 cases surging in so many states and outbreaks of popping up at camps from Georgia to Oregon, the safest place for you and your kids to be this summer could be in your own backyard. Here five affordable ways to turn your home into a vacation spot to make the most of this homebound season.",
      "download_date": "2020-08-05 19:25:52",
      "filename": "https://www.cnbc.com/2020/08/05/how-to-make-your-backyard-and-home-more-fun-than-camp.html.json",
      "headline": "How to make your backyard and home more fun than camp",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106623867-1595261265295-gettyimages-1047203718-16426-2016_09_15-0058.jpeg?v=1596574825",
      "keyword": [
        "camp",
        "skin",
        "virtual",
        "play",
        "art",
        "kids",
        "sarfati",
        "pool",
        "fun",
        "higgins",
        "backyard"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:13:39",
      "source_domain": "www.cnbc.com",
      "summary": "Do camp activities at homeWhile nothing beats the real-deal, Lori Lerman Rotman, the director at Maine's Camp Caribou, says that with a little creativity, there's plenty of camp-like fun to be had at home. \"We remain strong together through simple traditions like summertime foods, toasts and a campfire, fire pit, or even a candle!\" \"These activities are fun ways for kids to practice perspective-taking, explore their passions and let their imaginations go,\" Higgins says. Have a Vegas-style pool partyYou don't need an in-ground pool to have a pool party this summer. (Stock tanks are actually troughs for livestock but people are turning them into backyard oasis.)",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/how-to-make-your-backyard-and-home-more-fun-than-camp.html"
    },
    {
      "article": "As Congress debates how to extend enhanced unemployment insurance (UI) in the next coronavirus stimulus package, one of the main arguments from Republican leaders against continuing the extra $600 per week in federal jobless benefits is that it discourages people from reentering the labor market because they are potentially earning more with it than they would from their job. That argument has been found not to hold water in a few different studies over the past few months. Now, another new study finds that longer periods of UI are actually beneficial for workers and the economy more broadly: Extending the number of weeks people can collect jobless benefits gives them the time to find a job actually suited to their expertise and skills, instead of forcing them to accept any job they're offered. This in turn increases labor market efficiency and productivity overall. That's according to a new working paper from the National Bureau of Economic Research, which compared the quality of the jobs people found under \"ordinary\" periods of unemployment to jobs found during the 2002 recession and the 2009 Great Recession in the U.S., when unemployment benefits were extended. When the U.S. extended unemployment insurance benefits during those times -- typically, individuals can qualify for up to 26 weeks of benefits on average in the U.S.; during the Great Recession, UI benefits averaged 79 weeks -- workers found \"better jobs, or jobs best suited for their education level and skill sets,\" than they would have otherwise, the authors find. \"UI generosity allows workers to search longer and eventually find jobs better suited to their skills,\" write the authors. This is especially true for women, people of color and less-educated workers, who don't have as much in savings to fall back on under normal economic conditions. Because people collecting jobless benefits don't feel pressured to take a new job right away, it \"frees up\" that job for someone else better suited for it, creating a \"chain reaction\" of workers finding better jobs. \"When a worker waits to get another job that is better suited to their skills, they turn down other jobs that may also be better suited for others,\" the authors write. However, that doesn't mean all workers find better jobs. There's still the possibility that those who might have been offered a position that they are underqualified for now won't be. Still, overall, workers find jobs that better suit them, the authors find.",
      "author": [
        "Alicia Adamczyk"
      ],
      "category": "Make It - Earn",
      "description": "A new working paper from the National Bureau of Economic Research finds that extending jobless benefits gives people the time to find a job actually suited to their expertise and skills, instead of forcing them to accept any job they can find. This in turn increases labor market efficiency and productivity overall.",
      "download_date": "2020-08-05 19:26:42",
      "filename": "https://www.cnbc.com/2020/08/05/national-bureau-of-economic-research-workers-find-better-jobs-when-ui-is-extended.html.json",
      "headline": "Workers find 'better' jobs for their qualifications when unemployment insurance is extended, according to new study",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106647488-1596560407151-office-focused-student-studying-counting-working-from-home-home-office-workspace-using-laptop_t20_Xv84e6.jpg?v=1596560482",
      "keyword": [
        "ui",
        "weeks",
        "study",
        "workers",
        "according",
        "unemployment",
        "jobs",
        "authors",
        "job",
        "benefits",
        "extended",
        "insurance",
        "better",
        "qualifications",
        "suited"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:00:01",
      "source_domain": "www.cnbc.com",
      "summary": "\"UI generosity allows workers to search longer and eventually find jobs better suited to their skills,\" write the authors. Because people collecting jobless benefits don't feel pressured to take a new job right away, it \"frees up\" that job for someone else better suited for it, creating a \"chain reaction\" of workers finding better jobs. \"When a worker waits to get another job that is better suited to their skills, they turn down other jobs that may also be better suited for others,\" the authors write. However, that doesn't mean all workers find better jobs. Still, overall, workers find jobs that better suit them, the authors find.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/national-bureau-of-economic-research-workers-find-better-jobs-when-ui-is-extended.html"
    },
    {
      "article": "Johnson & Johnson announced Wednesday that it will develop and deliver 100 million doses of its coronavirus vaccine for the U.S. in a deal totaling more than $1 billion. The company's experimental vaccine is currently in early-stage human trials and is expected to begin late-stage human trials in September, executives have previously said. The deal gives the U.S. the option to order an additional 200 million doses, according to the announcement. \"We are scaling up production in the U.S. and worldwide to deliver a SARS-CoV-2 vaccine for emergency use,\" said Dr. Paul Stoffels, chief science officer at Johnson & Johnson, in a statement. The U.S. had previously awarded J&J $456 million to develop its vaccine earlier this year. J&J said its goal is to supply more than 1 billion doses globally through 2021. J&J is one of a handful of companies that have reached a deal with the U.S. to supply their potential coronavirus vaccine upon federal approval. The U.S. announced on Friday it will pay drugmaker Sanofi and GlaxoSmithKline up to $2.1 billion to develop and deliver 100 million doses of their potential coronavirus vaccine. The U.S. also said it will pay Pfizer and biotech firm BioNTech $1.95 billion to produce and deliver 100 million doses of their Covid-19 vaccine if it proves safe and effective, the companies announced in late July. J&J's vaccine candidate, Ad26.COV2.S, is using the same technology it used to make its experimental Ebola vaccine, which was provided to people in the Democratic Republic of Congo in late 2019. This is developing news. Please check back later for updates.",
      "author": [
        "Noah Higgins-Dunn"
      ],
      "category": "Health & Science",
      "description": "Johnson & Johnson announced Wednesday that it will develop and deliver 100 million doses of its coronavirus vaccine for the U.S. in a deal totaling more than $1 billion.",
      "download_date": "2020-08-05 19:27:35",
      "filename": "https://www.cnbc.com/2020/08/05/jj-reaches-deal-with-us-for-100-million-doses-of-coronavirus-vaccine-at-more-than-1-billion.html.json",
      "headline": "Johnson & Johnson reaches deal with U.S. for 100 million doses of coronavirus vaccine at more than $1 billion",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106097408-1566846750350rtsx61s.jpg?v=1595543233",
      "keyword": [
        "johnson",
        "announced",
        "billion",
        "million",
        "doses",
        "develop",
        "reaches",
        "deal",
        "deliver",
        "vaccine",
        "coronavirus",
        "100"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 12:54:59",
      "source_domain": "www.cnbc.com",
      "summary": "Johnson & Johnson announced Wednesday that it will develop and deliver 100 million doses of its coronavirus vaccine for the U.S. in a deal totaling more than $1 billion. The deal gives the U.S. the option to order an additional 200 million doses, according to the announcement. J&J said its goal is to supply more than 1 billion doses globally through 2021. J&J is one of a handful of companies that have reached a deal with the U.S. to supply their potential coronavirus vaccine upon federal approval. The U.S. announced on Friday it will pay drugmaker Sanofi and GlaxoSmithKline up to $2.1 billion to develop and deliver 100 million doses of their potential coronavirus vaccine.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/jj-reaches-deal-with-us-for-100-million-doses-of-coronavirus-vaccine-at-more-than-1-billion.html"
    },
    {
      "article": "Grant Gish hasn't even started yet as the new head of adult animation for ViacomCBS' Entertainment and Youth Group, and he's already got a task: build out the \"South Park\" franchise with Matt Stone and Trey Parker. ViacomCBS named Gish its new senior vice president of adult animation on Wednesday. Gish has been vice president of comedy and animation at Disney's Marvel Studios and doesn't actually start at ViacomCBS until August 31. But although he hasn't yet met Stone or Parker, his bosses want him to work with the show's creators to make new \"South Park\" movies and specials pegged to special events to build on a new strategy for the company: turning in-house intellectual property into new hits. \"As long as you're doing something new, and that could be anything from a new style to a new tone to a new voice coming from a specific writer, I think it can work,\" said Gish in an exclusive interview with CNBC. \"An animation audience is looking for something unique. That's what 'The Simpsons' and 'South Park' have famously done. So I want to try a little bit of everything, even though a lot of it will be targeted to the tried and true with brands people know.\" ViacomCBS has held talks with Stone and Parker on a number of movie and special ideas and hopes to finalize plans in the next year, according to a person familiar with the matter, who asked not to be named because the discussions are private. While Stone and Parker continue to create more episodes of \"South Park\" for Comedy Central, WarnerMedia's HBO Max paid about $500 million to Viacom to license back episodes for the next several years. That deal was struck before Viacom and CBS merged and decided to build out CBS All Access to a much larger streaming service. When the \"South Park\" licensing deal expires, ViacomCBS could house the series and any new movies and specials made in the coming years on its own streaming service. Gish will be handed a small set of former hit shows that are being dusted off for a new audience. The company has already agreed to make \"Jodie,\" a spinoff of the 1990s MTV cult classic \"Daria,\" along with a revived \"Beavis and Butt-Head\" made by original creator Mike Judge. Comedy Central also announced a \"reimagination\" of \"The Ren & Stimpy Show\" on Wednesday, moving the series from its Nickelodeon roots in the 1990s to the adult comedy network. The strategy fits with ViacomCBS's \"house of brands\" streaming strategy, which will highlight Comedy Central, Nickelodeon, MTV and BET within its existing CBS All Access subscription service. ViacomCBS plans to rebrand the service before officially relaunching it in early 2021. The company already announced a new \"SpongeBob SquarePants\" movie will debut with the service's launch, continuing the theme of building out existing franchises. ViacomCBS hired Gish after seeing his work at Marvel and Fox, where he helped develop \"Bob's Burgers\" and oversaw \"American Dad.\" Marvel has built movies and TV shows on old characters, such as Black Panther, to create popular tent-pole franchises. ViacomCBS hopes Gish can do the same thing with its own intellectual property, which dominated pop culture in the 1990s and early 2000s but has fallen off in popularity in the last 15 to 20 years. \"The point of what we're doing is unlocking the value of those shows today and reimagining them for a whole new generation,\" said Chris McCarthy, president of ViacomCBS's Entertainment & Youth Brands. \"'Beavis and Butthead' has a 93% brand awareness. In this super crowded landscape, having IP that people feel passionate about brings that audience in.\" Gish's challenge will be making sure \"Beavis and Butthead\" and \"Jodie\" speak to younger audiences the same way they connected with Generation X'ers. \"These were shows I grew up on,\" said Gish. \"Taking these brands and making something new for 2021, 2022, or finding and making something new for Comedy Central, Nickelodeon -- again, networks I grew up on -- it's just a great opportunity.\" ViacomCBS reports its quarterly earnings on Thursday. WATCH: 'South Park' banned in China after mocking censorship",
      "author": [
        "Alex Sherman"
      ],
      "category": "Technology",
      "description": "ViacomCBS has hired Grant Gish as its new head of adult animation. One of his first tasks is to convince Trey Parker and Matt Stone to do more \"South Park\" movies and specials.",
      "download_date": "2020-08-05 19:28:21",
      "filename": "https://www.cnbc.com/2020/08/05/viacomcbs-hopes-to-create-south-park-movies.html.json",
      "headline": "New ViacomCBS adult animation executive hopes to secure more 'South Park' movies as company leans on old brands to spur new audience",
      "image_url": "https://image.cnbcfm.com/api/v1/image/100814348-South-Park-The-Stick-of-Truth.jpg?v=1371159841",
      "keyword": [
        "spur",
        "park",
        "south",
        "animation",
        "executive",
        "old",
        "leans",
        "central",
        "comedy",
        "shows",
        "movies",
        "hopes",
        "brands",
        "secure",
        "viacomcbs",
        "gish",
        "stone"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 12:30:01",
      "source_domain": "www.cnbc.com",
      "summary": "Gish has been vice president of comedy and animation at Disney's Marvel Studios and doesn't actually start at ViacomCBS until August 31. That's what 'The Simpsons' and 'South Park' have famously done. When the \"South Park\" licensing deal expires, ViacomCBS could house the series and any new movies and specials made in the coming years on its own streaming service. Comedy Central also announced a \"reimagination\" of \"The Ren & Stimpy Show\" on Wednesday, moving the series from its Nickelodeon roots in the 1990s to the adult comedy network. WATCH: 'South Park' banned in China after mocking censorship",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/viacomcbs-hopes-to-create-south-park-movies.html"
    },
    {
      "article": "U.S. government to pay $1 billion for 100 million doses of Johnson & Johnson Covid-19 vaccine Johnson & Johnson has reached an agreement with the U.S. government to supply 100 million Covid-19 vaccines for a $1 billion payment. CNBC's Becky Quick reports.",
      "author": [],
      "category": null,
      "description": "Johnson & Johnson has reached an agreement with the U.S. government to supply 100 million Covid-19 vaccines for a $1 billion payment. CNBC's Becky Quick reports.",
      "download_date": "2020-08-05 19:28:46",
      "filename": "https://www.cnbc.com/video/2020/08/05/us-government-to-pay-1-billion-for-100-million-doses-of-johnson-johnson-covid-19-vaccine.html.json",
      "headline": "U.S. government to pay $1 billion for 100 million doses of Johnson & Johnson Covid-19 vaccine",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106619304-1594906748312gettyimages-1227380699.jpeg?v=1594907457",
      "keyword": [
        "pay",
        "johnson",
        "vaccines",
        "reports",
        "billion",
        "covid19",
        "million",
        "doses",
        "reached",
        "vaccinejohnson",
        "supply",
        "vaccine",
        "100"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 12:56:35",
      "source_domain": "www.cnbc.com",
      "summary": "U.S. government to pay $1 billion for 100 million doses of Johnson & Johnson Covid-19 vaccineJohnson & Johnson has reached an agreement with the U.S. government to supply 100 million Covid-19 vaccines for a $1 billion payment. CNBC's Becky Quick reports.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/video/2020/08/05/us-government-to-pay-1-billion-for-100-million-doses-of-johnson-johnson-covid-19-vaccine.html"
    },
    {
      "article": "Federal Reserve Vice Chairman Richard Clarida on economic outlook Federal Reserve Vice Chairman Richard Clarida tells CNBC's Steve Liesman he expects the economy to continue to recover through the end of the year and likely return to its pre-pandemic level by the end of the 2021.",
      "author": [],
      "category": null,
      "description": "Federal Reserve Vice Chairman Richard Clarida tells CNBC's Steve Liesman he expects the economy to continue to recover through the end of the year and likely return to its pre-pandemic level by the end of the 2021.",
      "download_date": "2020-08-05 19:29:52",
      "filename": "https://www.cnbc.com/video/2020/08/05/federal-reserve-vice-chairman-richard-clarida-on-economic-outlook.html.json",
      "headline": "Federal Reserve Vice Chairman Richard Clarida on economic outlook",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106649194-15966313641596631358-10713227139-1080pnbcnews.jpg?v=1596631363",
      "keyword": [
        "tells",
        "federal",
        "outlook",
        "steve",
        "recover",
        "economic",
        "vice",
        "chairman",
        "clarida",
        "end",
        "return",
        "reserve",
        "richard"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:40:27",
      "source_domain": "www.cnbc.com",
      "summary": "Federal Reserve Vice Chairman Richard Clarida on economic outlookFederal Reserve Vice Chairman Richard Clarida tells CNBC's Steve Liesman he expects the economy to continue to recover through the end of the year and likely return to its pre-pandemic level by the end of the 2021.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/video/2020/08/05/federal-reserve-vice-chairman-richard-clarida-on-economic-outlook.html"
    },
    {
      "Error": "Article is OLDER than 24 Hrs"
    },
    {
      "article": "Mining company AngloGold and a lion rang the Opening Bell in 1998 On August 5, 1998, AngloGold rang the Opening Bell at the New York Stock Exchange. In honor of their logo, a lion also joined. AngloGold became the first South African company to list on the NYSE.",
      "author": [],
      "category": null,
      "description": "On August 5, 1998, AngloGold rang the Opening Bell at the New York Stock Exchange. In honor of their logo, a lion also joined. AngloGold became the first South African company to list on the NYSE.",
      "download_date": "2020-08-05 19:31:24",
      "filename": "https://www.cnbc.com/video/2020/08/05/a-mining-company-brought-a-lion-to-ring-the-nyse-opening-bell-in-1998.html.json",
      "headline": "Mining company AngloGold and a lion rang the Opening Bell in 1998",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106647663-200805-StrategicContent-OpeningBell-Lion-jpg?v=1596569921",
      "keyword": [
        "lion",
        "1998",
        "mining",
        "opening",
        "stock",
        "rang",
        "south",
        "york",
        "company",
        "nyse",
        "anglogold",
        "bell"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:01:01",
      "source_domain": "www.cnbc.com",
      "summary": "Mining company AngloGold and a lion rang the Opening Bell in 1998On August 5, 1998, AngloGold rang the Opening Bell at the New York Stock Exchange. In honor of their logo, a lion also joined. AngloGold became the first South African company to list on the NYSE.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/video/2020/08/05/a-mining-company-brought-a-lion-to-ring-the-nyse-opening-bell-in-1998.html"
    },
    {
      "article": "Moderna shares swing in pre-market following earnings CNBC's Scott Wapner reports about Moderna stock's volatility in the pre-market on Wednesday following the company's earnings report.",
      "author": [],
      "category": null,
      "description": "CNBC's Scott Wapner reports about Moderna stock's volatility in the pre-market on Wednesday following the company's earnings report.",
      "download_date": "2020-08-05 19:32:30",
      "filename": "https://www.cnbc.com/video/2020/08/05/moderna-shares-swing-in-pre-market-following-earnings.html.json",
      "headline": "Moderna shares swing in pre-market following earnings",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106617814-1594840310068ap_20139596621040.jpg?v=1594840390",
      "keyword": [
        "reports",
        "stocks",
        "volatility",
        "wapner",
        "shares",
        "swing",
        "moderna",
        "following",
        "scott",
        "earnings",
        "premarket"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 12:58:35",
      "source_domain": "www.cnbc.com",
      "summary": "Moderna shares swing in pre-market following earningsCNBC's Scott Wapner reports about Moderna stock's volatility in the pre-market on Wednesday following the company's earnings report.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/video/2020/08/05/moderna-shares-swing-in-pre-market-following-earnings.html"
    },
    {
      "article": "Democratic presidential candidate and former Vice President Joe Biden speaks about his plans to combat racial inequality at a campaign event in Wilmington, Delaware, U.S., July 28, 2020. Latinos are one of the largest growing demographics in the country, and their support is essential to ensuring a win that cannot be challenged or litigated - especially in key battleground states like Arizona, Florida, Nevada, North Carolina, Pennsylvania, and Texas. However, according to a new survey conducted by the Voter Participation Center in partnership with Voto Latino and Latino Decisions, less than 60 percent of eligible Latino voters say they definitely plan to cast a ballot in 2020 and demonstrate a low enthusiasm about the candidacy of Vice President Joe Biden. Even though Donald Trump has no viable path to gain majority Latino support as he makes anti-immigration a foundation of his re-election, Biden's approval among young Latinos is waning. Today, Biden's support is down seven points from 67 percent back in February. By comparison, during this time in 2016, Hillary Clinton enjoyed 73 percent support among Latinos. A big issue is outreach. Most Latinos say they haven't even heard from Joe Biden's campaign nor the Democratic party. Just 32 percent of low-propensity Latino voters say the Democrats are doing a good job of outreach while only 27 percent of Latinos ages 18-29 agree. On the contrary, Latino Republicans report higher levels of connectivity with their party than Democrats, with 53 percent of self-identified Republican respondents saying they were contacted by someone, compared to 43 percent of Democrats. The split widens among those expressing a specific candidate preference, with 59 percent of Trump supporters and just 41 percent of Biden backers reporting being contacted by a political party, campaign or organization so far this year. In the context of a president who targets Latinos and other communities of color, these numbers are alarming.",
      "author": [
        "Maria Teresa Kumar"
      ],
      "category": "Politics",
      "description": "Even though Donald Trump has no viable path to gain majority Latino support as he makes anti-immigration a foundation of his re-election, Biden's approval among young Latinos is waning.",
      "download_date": "2020-08-05 19:33:35",
      "filename": "https://www.cnbc.com/2020/08/05/op-ed-joe-biden-has-a-latino-voter-problem-heres-how-he-can-fix-it.html.json",
      "headline": "Op-ed: Joe Biden has a Latino voter problem. Here's how he can fix it",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106649293-15966337882020-07-28t211648z_1512748606_rc2l2i9bvayj_rtrmadp_0_usa-election-biden.jpeg?v=1596633819",
      "keyword": [
        "joe",
        "heres",
        "fix",
        "bidens",
        "oped",
        "voter",
        "latinos",
        "biden",
        "say",
        "campaign",
        "latino",
        "voters",
        "problem",
        "president",
        "party",
        "support"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:48:43",
      "source_domain": "www.cnbc.com",
      "summary": "Democratic presidential candidate and former Vice President Joe Biden speaks about his plans to combat racial inequality at a campaign event in Wilmington, Delaware, U.S., July 28, 2020. However, according to a new survey conducted by the Voter Participation Center in partnership with Voto Latino and Latino Decisions, less than 60 percent of eligible Latino voters say they definitely plan to cast a ballot in 2020 and demonstrate a low enthusiasm about the candidacy of Vice President Joe Biden. Today, Biden's support is down seven points from 67 percent back in February. Most Latinos say they haven't even heard from Joe Biden's campaign nor the Democratic party. Just 32 percent of low-propensity Latino voters say the Democrats are doing a good job of outreach while only 27 percent of Latinos ages 18-29 agree.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/op-ed-joe-biden-has-a-latino-voter-problem-heres-how-he-can-fix-it.html"
    },
    {
      "article": "Voters cast their ballots in Missouri's primary election on August 4, 2020 at Gambrinus Hall in St Louis, Missouri. Voters will see a host of changes because of the COVID 19 pandemic including less polling places but bigger locations to help with social distancing. Voters on Tuesday made Missouri the 38th state to approve expanding Medicaid health care coverage to thousands more low-income adults. Support for the constitutional amendment means that as many as 250,000 more adults could choose to be covered by government health insurance beginning in July 2021, according to estimates from the state auditor. \"As Medicaid expansion is fully and expeditiously implemented so that Missourians are no longer forced to choose between putting food on the table and seeing a doctor, today's victory will be a true turning point in the history of the Show Me State,\" said A.J. Bockelman, the pro-Medicaid campaign manager. The vote on health care, which was paired with Missouri's primary elections, came as confirmed coronavirus cases have been rising in the state and the economy continues to suffer. \"I believe the economy is going to bounce back strongly but not anytime soon,\" said 62-year-old Jim Roberts, an employee in the Clay County Prosecutor's office in Liberty who voted to expand Medicaid. \"Jesus said 'The poor will be with you always,' but we still need to address the concerns of those who are less fortunate.\" Concerns about the virus appear to have driven a record number of people to cast absentee ballots in Missouri's largest jurisdiction of St. Louis County, said county election director Eric Fey. Election officials said coronavirus concerns also led to a somewhat larger number of cancellations and no-shows among poll workers in the St. Louis and Kansas City areas, though substitutes were dispatched to fill the gaps. Voters on Tuesday also picked the Republican and Democratic candidates for Congress, statewide offices and state legislative seats. Cori Bush, a onetime homeless woman who led protests following a white police officer's fatal shooting of a Black 18-year-old in Ferguson, ousted longtime Rep. William Lacy Clay in Missouri's 1st District Democratic primary, ending a political dynasty that has spanned more than a half-century. St. Louis Circuit Attorney Kim Gardner, whose job performance has been lauded by some civil rights activists and criticized by President Donald Trump and other leading Republicans, also won a challenge from former homicide prosecutor Mary Pat Carl. Missouri's Republican-led Legislature has repeatedly rejected Medicaid expansion proposals over the past decade, prompting supporters to turn to the initiative process. Idaho, Maine, Nebraska, Oklahoma and Utah have all expanded Medicaid through ballot questions following inaction by state lawmakers, according to the nonpartisan Kaiser Family Foundation. Oklahoma became the 37th state to expand eligibility for Medicaid under the federal law last month. Missouri's Medicaid program currently does not cover most adults without children, and its income eligibility threshold for parents is one of the lowest in the nation at about one-fifth of the poverty level. The ballot proposal will expand eligibility under the terms of the 2010 federal health care law signed by President Barack Obama. That law provides a higher-than-usual federal funding share for states that expand Medicaid coverage to adults earning up to 138% of the federal poverty level, about $17,600 for an individual or $30,000 for a family of three. The office of Democratic Auditor Nicole Galloway, who won the Democratic primary for governor on Tuesday, said the financial impact on the state was not clear. The office has estimated that expanding Medicaid could cost the state at least $200 million or save as much as $1 billion annually by 2026. Republican opponents cited the potential costs as reason to oppose the ballot initiative. Bonnie Ciro, 73, a hairdresser in Liberty, said she voted against the proposal because she doesn't trust politicians to use the money, and she doesn't want to pay higher taxes. \"It's too much money,\" Ciro said. \"I think it's a scam, I don't trust what they say. (Politicians) tell you one thing and then do another thing with these kinds of programs.\" By proposing a constitutional amendment instead of a new law, Missouri supporters have ensured that lawmakers will be unable to change it without going back to voters. Republican Gov. Mike Parson, who opposes Medicaid expansion and won the Republican primary for a full term, moved the vote on the proposal up from the Nov. 3 general election to Tuesday's primary. Parson said the earlier vote would give the state more time to financially prepare for Medicaid expansion, if it passes. He said his decision was not about politics. Galloway's campaign has said Parson switched the day of the vote on Medicaid because fewer people typically vote in August compared to November, possibly giving opponents a better chance of defeating the measure. Voter turnout during the 2016 presidential general election in Missouri was almost three times higher than turnout for that year's August primary. Even in 2018, a record year for turnout during a primary, roughly 1 million more voters turned up at the polls in November compared to August. Local election authorities projected a statewide voter turnout of nearly 37% Tuesday.",
      "author": [],
      "category": "Politics",
      "description": "Voters on Tuesday made Missouri the 38th state to approve expanding Medicaid health care coverage to thousands more low-income adults, the Associated Press reports",
      "download_date": "2020-08-05 19:34:15",
      "filename": "https://www.cnbc.com/2020/08/05/missouri-voters-approve-medicaid-expansion.html.json",
      "headline": "Missouri voters approve Medicaid expansion",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106649285-1596633425480-gettyimages-1227908291-775542290004.jpeg?v=1596633467",
      "keyword": [
        "law",
        "approve",
        "election",
        "state",
        "primary",
        "missouris",
        "medicaid",
        "turnout",
        "louis",
        "voters",
        "missouri",
        "vote",
        "expansion"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 13:29:55",
      "source_domain": "www.cnbc.com",
      "summary": "Voters cast their ballots in Missouri's primary election on August 4, 2020 at Gambrinus Hall in St Louis, Missouri. Voters on Tuesday made Missouri the 38th state to approve expanding Medicaid health care coverage to thousands more low-income adults. Missouri's Republican-led Legislature has repeatedly rejected Medicaid expansion proposals over the past decade, prompting supporters to turn to the initiative process. By proposing a constitutional amendment instead of a new law, Missouri supporters have ensured that lawmakers will be unable to change it without going back to voters. Parson said the earlier vote would give the state more time to financially prepare for Medicaid expansion, if it passes.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/missouri-voters-approve-medicaid-expansion.html"
    },
    {
      "article": "People protest against the passage of a mail-in voting bill during a Nevada Republican party demonstration at the Grant Sawyer State Office Building on August 4, 2020 in Las Vegas, Nevada. The re-election campaign of President Donald Trump on Tuesday night followed through on his threats to sue Nevada over its plan to conduct the November election almost entirely by mail-in ballot. The suit, which claims such statewide voting by mail is unconstitutional, comes one day after Nevada Gov. Steve Sisolak signed a bill that would facilitate mail-in voting for most of the state, with a limited number of in-person polls. Trump has been railing against mail-in voting since spring, arguing that it invites voter fraud. There's no evidence of widespread voter fraud in the United States, according to numerous investigations and studies. In May the president threatened on Twitter to \"hold up funds to the State\" over voting by mail. The suit, filed in U.S. District Court in Nevada, argues that the law signed by Sisolak, would essentially mean that voters no longer must weigh in before Election Day and that vote counting delayed as a result of possible U.S. Postal Service sluggishness would prolong elections beyond a reasonable time frame. The Nevada law \"contravenes those valid federal laws by requiring elections officials to accept and count ballots received after Election Day even when those ballots lack objective evidence that voters cast them on or before Election Day,\" the lawsuit states. \"In short, AB4 effectively postpones and prolongs Nevada's 2020 general election past the Election Day established by Congress.\" The governor's office did not immediately respond to request for comment Tuesday night. The bill, which vows that every Nevadan will get a ballot by mail, came in the wake of Nevada Secretary of State Barbara Cegavske's decision in March to hold the state's June primary by mail in response to the ongoing coronavirus pandemic. The suit was filed on behalf of the Trump campaign as well as the Republican National Committee and the Nevada Republican Party. It decries the Nevada law because, it says, the legislation was passed by \"a straight-party-line vote taken on a Sunday afternoon.\" The suit argues that because some counties in Nevada preside over elections, residents' votes could be treated differently depending on where they live. The claim also outlined the president's own concerns with mail-in voting that, despite his own use of absentee ballots, they invite fraud. It cites examples of ballots found in the trash and stuffed haphazardly in mailboxes. Voter fraud in Nevada, the suit claims, is \"inevitable.\" But there is no evidence of widespread voter fraud, by mail or otherwise. In March, Trump said on Fox News' \"Fox & Friends\" that Democratic Party efforts to make voting easier and more widespread would doom the Republicans. \"They had levels of voting, that if you ever agreed to it you'd never have a Republican elected in this country again,\" the president said. The filing seeks a judgment that Nevada's mail-in voting law is unconstitutional under federal election law and under the Fourteenth Amendment's vow of equal protection for citizens.",
      "author": [
        "Dennis Romero"
      ],
      "category": "Politics",
      "description": "Nevada recently passed a law making its November election almost entirely by mail, but Trump wants to stop it, NBC News reports",
      "download_date": "2020-08-05 19:35:02",
      "filename": "https://www.cnbc.com/2020/08/05/trump-campaign-sues-to-try-to-stop-nevadans-from-voting-by-mail.html.json",
      "headline": "Trump campaign sues to try to stop Nevadans from voting by mail",
      "image_url": "https://image.cnbcfm.com/api/v1/image/106649220-1596632244101-gettyimages-1263990696-em5_1626_2020080470342499.jpeg?v=1596632315",
      "keyword": [
        "law",
        "day",
        "election",
        "state",
        "mail",
        "trump",
        "nevada",
        "fraud",
        "voter",
        "voting",
        "mailin",
        "sues",
        "campaign",
        "nevadans",
        "suit",
        "try",
        "stop"
      ],
      "language": "en",
      "modify_date": "None",
      "publication": "CNBC",
      "publish_date": "2020-08-05 12:53:21",
      "source_domain": "www.cnbc.com",
      "summary": "Steve Sisolak signed a bill that would facilitate mail-in voting for most of the state, with a limited number of in-person polls. Trump has been railing against mail-in voting since spring, arguing that it invites voter fraud. \"In short, AB4 effectively postpones and prolongs Nevada's 2020 general election past the Election Day established by Congress.\" It decries the Nevada law because, it says, the legislation was passed by \"a straight-party-line vote taken on a Sunday afternoon.\" The filing seeks a judgment that Nevada's mail-in voting law is unconstitutional under federal election law and under the Fourteenth Amendment's vow of equal protection for citizens.",
      "title_page": null,
      "title_rss": null,
      "url": "https://www.cnbc.com/2020/08/05/trump-campaign-sues-to-try-to-stop-nevadans-from-voting-by-mail.html"
    }
  ]
}